In [1]:
import pandas as pd

df1 = pd.read_csv("my_data.csv")
df2 = pd.read_csv("filename.csv")
df3 = pd.read_csv("employee_data.csv")

# Display the dataframes
print("DF1:")
display(df1)

print("DF2:")
display(df2)

print("DF3:")
display(df3)

DF1:

      id    project     cost    status
0   A001   Project1  1002000  finished
1   A002   Project2  2000000   Ongoing
2   A003   Project3  4500000  finished
3   A004   Project4  5500000   ongoing
4   A005   Project5  1744333  finished
5   A002   Project6   680000    failed
6   A005   Project7   400000  finished
7   A003   Project8   350000    failed
8   A001   Project9  1744333   ongoing
9   A003  Project10   300000  finished
10  A001  Project11  2000000    failed
11  A004  Project12  1000000   ongoing
12  A004  Project13  3000000  finished
13  A005  Project14   200000  finished

DF2:

     id  Designation level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

DF3:

     id Gender     City  Age First Name  Last Name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [2]:
Final = df1.merge(df2, on="id", how="inner").merge(df3, on="id", how="inner")

In [3]:
Final = df1.merge(df2, on="id", how="inner").merge(df3, on="id", how="inner")

display(Final)

,id,project,cost,status,Designation level,Gender,City,Age,First Name,Last Name
0,A001,Project1,1002000,finished,2,M,Paris,25,John,Alter
1,A002,Project2,2000000,Ongoing,2,F,London,27,Alice,Luxumberg
2,A003,Project3,4500000,finished,3,M,Berlin,29,Tom,Sabestine
3,A004,Project4,5500000,ongoing,2,F,Newyork,31,Nina,Adgra
4,A005,Project5,1744333,finished,3,F,Madrid,30,Amy,Johny
5,A002,Project6,680000,failed,2,F,London,27,Alice,Luxumberg
6,A005,Project7,400000,finished,3,F,Madrid,30,Amy,Johny
7,A003,Project8,350000,failed,3,M,Berlin,29,Tom,Sabestine
8,A001,Project9,1744333,ongoing,2,M,Paris,25,John,Alter
9,A003,Project10,300000,finished,3,M,Berlin,29,Tom,Sabestine
10,A001,Project11,2000000,failed,2,M,Paris,25,John,Alter
11,A004,Project12,1000000,ongoing,2,F,Newyork,31,Nina,Adgra
12,A004,Project13,3000000,finished,2,F,Newyork,31,Nina,Adgra
13,A005,Project14,200000,finished,3,F,Madrid,30,Amy,Johny

In [4]:
Final["bonus"] = Final.apply(
    lambda row: row["cost"] * 0.05 if row["status"].strip().lower() == "finished" else 0,
    axis=1
)
display(Final)

,id,project,cost,status,Designation level,Gender,City,Age,First Name,Last Name,bonus
0,A001,Project1,1002000,finished,2,M,Paris,25,John,Alter,50100.00
1,A002,Project2,2000000,Ongoing,2,F,London,27,Alice,Luxumberg,0.00
2,A003,Project3,4500000,finished,3,M,Berlin,29,Tom,Sabestine,225000.00
3,A004,Project4,5500000,ongoing,2,F,Newyork,31,Nina,Adgra,0.00
4,A005,Project5,1744333,finished,3,F,Madrid,30,Amy,Johny,87216.65
5,A002,Project6,680000,failed,2,F,London,27,Alice,Luxumberg,0.00
6,A005,Project7,400000,finished,3,F,Madrid,30,Amy,Johny,20000.00
7,A003,Project8,350000,failed,3,M,Berlin,29,Tom,Sabestine,0.00
8,A001,Project9,1744333,ongoing,2,M,Paris,25,John,Alter,0.00
9,A003,Project10,300000,finished,3,M,Berlin,29,Tom,Sabestine,15000.00
10,A001,Project11,2000000,failed,2,M,Paris,25,John,Alter,0.00
11,A004,Project12,1000000,ongoing,2,F,Newyork,31,Nina,Adgra,0.00
12,A004,Project13,3000000,finished,2,F,Newyork,31,Nina,Adgra,150000.00
13,A005,Project14,200000,finished,3,F,Madrid,30,Amy,Johny,10000.00

In [6]:
df = pd.DataFrame(Final)

# Step 1: Demote designation level by 1 for employees with failed projects
df.loc[df['status'].str.lower() == 'failed', 'Designation level'] -= 1

# Step 2: Delete employees whose designation level is above 4
df = df[df['Designation level'] <= 4]

# Display the updated DataFrame
print(df)

      id    project     cost    status  Designation level Gender     City  \
0   A001   Project1  1002000  finished                  2      M    Paris
1   A002   Project2  2000000   Ongoing                  2      F   London
2   A003   Project3  4500000  finished                  3      M   Berlin
3   A004   Project4  5500000   ongoing                  2      F  Newyork
4   A005   Project5  1744333  finished                  3      F   Madrid
5   A002   Project6   680000    failed                  1      F   London
6   A005   Project7   400000  finished                  3      F   Madrid
7   A003   Project8   350000    failed                  2      M   Berlin
8   A001   Project9  1744333   ongoing                  2      M    Paris
9   A003  Project10   300000  finished                  3      M   Berlin
10  A001  Project11  2000000    failed                  1      M    Paris
11  A004  Project12  1000000   ongoing                  2      F  Newyork
12  A004  Project13  3000000  finished                  2      F  Newyork
13  A005  Project14   200000  finished                  3      F   Madrid

    Age First Name  Last Name      bonus
0    25       John      Alter   50100.00
1    27      Alice  Luxumberg       0.00
2    29        Tom  Sabestine  225000.00
3    31       Nina      Adgra       0.00
4    30        Amy      Johny   87216.65
5    27      Alice  Luxumberg       0.00
6    30        Amy      Johny   20000.00
7    29        Tom  Sabestine       0.00
8    25       John      Alter       0.00
9    29        Tom  Sabestine   15000.00
10   25       John      Alter       0.00
11   31       Nina      Adgra       0.00
12   31       Nina      Adgra  150000.00
13   30        Amy      Johny   10000.00

In [7]:
df = pd.DataFrame(Final)

# Step 1: Add "Mr." or "Mrs." prefix based on Gender
df['First Name'] = df.apply(lambda x: "Mr. " + x['First Name'] if x['Gender'] == 'M' else "Mrs. " + x['First Name'], axis=1)

# Step 2: Drop the Gender column
df = df.drop(columns=['Gender'])

# Display the updated DataFrame
print(df)

      id    project     cost    status  Designation level     City  Age  \
0   A001   Project1  1002000  finished                  2    Paris   25
1   A002   Project2  2000000   Ongoing                  2   London   27
2   A003   Project3  4500000  finished                  3   Berlin   29
3   A004   Project4  5500000   ongoing                  2  Newyork   31
4   A005   Project5  1744333  finished                  3   Madrid   30
5   A002   Project6   680000    failed                  1   London   27
6   A005   Project7   400000  finished                  3   Madrid   30
7   A003   Project8   350000    failed                  2   Berlin   29
8   A001   Project9  1744333   ongoing                  2    Paris   25
9   A003  Project10   300000  finished                  3   Berlin   29
10  A001  Project11  2000000    failed                  1    Paris   25
11  A004  Project12  1000000   ongoing                  2  Newyork   31
12  A004  Project13  3000000  finished                  2  Newyork   31
13  A005  Project14   200000  finished                  3   Madrid   30

    First Name  Last Name      bonus
0     Mr. John      Alter   50100.00
1   Mrs. Alice  Luxumberg       0.00
2      Mr. Tom  Sabestine  225000.00
3    Mrs. Nina      Adgra       0.00
4     Mrs. Amy      Johny   87216.65
5   Mrs. Alice  Luxumberg       0.00
6     Mrs. Amy      Johny   20000.00
7      Mr. Tom  Sabestine       0.00
8     Mr. John      Alter       0.00
9      Mr. Tom  Sabestine   15000.00
10    Mr. John      Alter       0.00
11   Mrs. Nina      Adgra       0.00
12   Mrs. Nina      Adgra  150000.00
13    Mrs. Amy      Johny   10000.00

In [9]:
df = pd.DataFrame(Final)

# Promote designation level by 1 for employees whose age > 29
df['Designation level'] = df.apply(lambda x: x['Designation level'] + 1 if x['Age'] > 29 else x['Designation level'], axis=1)

# Display the updated DataFrame
print(df)

      id    project     cost    status  Designation level Gender     City  \
0   A001   Project1  1002000  finished                  2      M    Paris
1   A002   Project2  2000000   Ongoing                  2      F   London
2   A003   Project3  4500000  finished                  3      M   Berlin
3   A004   Project4  5500000   ongoing                  3      F  Newyork
4   A005   Project5  1744333  finished                  4      F   Madrid
5   A002   Project6   680000    failed                  1      F   London
6   A005   Project7   400000  finished                  4      F   Madrid
7   A003   Project8   350000    failed                  2      M   Berlin
8   A001   Project9  1744333   ongoing                  2      M    Paris
9   A003  Project10   300000  finished                  3      M   Berlin
10  A001  Project11  2000000    failed                  1      M    Paris
11  A004  Project12  1000000   ongoing                  3      F  Newyork
12  A004  Project13  3000000  finished                  3      F  Newyork
13  A005  Project14   200000  finished                  4      F   Madrid

    Age First Name  Last Name      bonus
0    25       John      Alter   50100.00
1    27      Alice  Luxumberg       0.00
2    29        Tom  Sabestine  225000.00
3    31       Nina      Adgra       0.00
4    30        Amy      Johny   87216.65
5    27      Alice  Luxumberg       0.00
6    30        Amy      Johny   20000.00
7    29        Tom  Sabestine       0.00
8    25       John      Alter       0.00
9    29        Tom  Sabestine   15000.00
10   25       John      Alter       0.00
11   31       Nina      Adgra       0.00
12   31       Nina      Adgra  150000.00
13   30        Amy      Johny   10000.00

In [10]:
df = pd.DataFrame(Final)

# Group by ID and First Name and sum the cost
TotalProjCost = df.groupby(['id','First Name'], as_index=False)['cost'].sum()

# Rename columns
TotalProjCost = TotalProjCost.rename(columns={'cost': 'Total cost'})

# Display the new DataFrame
print(TotalProjCost)

     id First Name  Total cost
0  A001       John     4746333
1  A002      Alice     2680000
2  A003        Tom     5150000
3  A004       Nina     9500000
4  A005        Amy     2344333

In [12]:
df = pd.DataFrame(Final)

# Filter rows where City contains the letter "o" (case-insensitive)
filtered_df = df[df['City'].str.contains('o', case=False)]

# Display the filtered employee details
print(filtered_df)

      id    project     cost    status  Designation level Gender     City  \
1   A002   Project2  2000000   Ongoing                  2      F   London
3   A004   Project4  5500000   ongoing                  2      F  Newyork
5   A002   Project6   680000    failed                  1      F   London
11  A004  Project12  1000000   ongoing                  2      F  Newyork
12  A004  Project13  3000000  finished                  2      F  Newyork

    Age First Name  Last Name     bonus
1    27      Alice  Luxumberg       0.0
3    31       Nina      Adgra       0.0
5    27      Alice  Luxumberg       0.0
11   31       Nina      Adgra       0.0
12   31       Nina      Adgra  150000.0